{
	"name": "createDevice",
	"category": "Pairing",
	"shortDescription": "Manually creates a device",
	"description": "This method manually creates a new device. It is not supported by all device families, and it is also not supported for all devices. createDevice can be used to create virtual devices in the family \"Miscellaneous\".",
	"signatures": [
		"Integer createDevice(Integer familyId, Integer deviceType, String serialNumber, Integer address, Integer firmwareVersion)",
		"Integer createDevice(Integer familyId, Integer deviceType, String serialNumber, Integer address, Integer firmwareVersion, String interfaceId)"
	],
	"parameters": [{
		"name": "familyId",
		"type": "Integer",
		"description": "This is the ID of the family you want to create the device in. See: <a href=\"#listFamilies\">listFamilies</a>.",
		"exampleValue": "1"
	}, {
		"name": "deviceType",
		"type": "Integer",
		"description": "The type ID of the device as specified in the device's XML file",
		"exampleValue": "483"
	}, {
		"name": "serialNumber",
		"type": "String",
		"description": "The serial number of the new device",
		"exampleValue": "MY_DEVICE1"
	}, {
		"name": "address",
		"type": "Integer",
		"description": "This is the physical address of the new device. Depending on the device family, this parameter might be optional. If it is not needed, set it to \"-1\".",
		"exampleValue": "9874387"
	}, {
		"name": "firmwareVersion",
		"type": "Integer",
		"description": "This is the firmware version of the new device. Depending on the device family, this parameter might be optional. If the firmware version is \"1.2\", set this variable to 0x12 = 18. If it is not needed, set it to \"-1\".",
		"exampleValue": "18"
	}, {
		"name": "interfaceId",
		"type": "String",
		"description": "The ID of the interface as defined in the family configuration file with which you want to associate the newly created device",
		"exampleValue": "My-Interface"
	}],
	"returnValue": "Returns the ID of the new device on success",
	"errors": [{
		"code": -2,
		"description": "The device family is unknown or unavailable."
	}, {
		"code": -5,
		"description": "A device with this serial number or address already exists."
	}, {
		"code": -6,
		"description": "This device type is unknown."
	}, {
		"code": -32601,
		"description": "Method not implemented by the device family"
	}]
}
